
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры


&НаКлиенте
Процедура ТипОрганизацииПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	Если Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ЮридическоеЛицо") Тогда
		Элементы.ГлавныйБухгалтер.Видимость = Истина;
		Элементы.ИНН.Маска = "9999999999"; 
	Иначе
		Элементы.ГлавныйБухгалтер.Видимость = Ложь;
		Элементы.ИНН.Маска = "999999999999";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ИННПриИзменении(Элемент)
	ИНН = СокрЛП(Объект.ИНН);
	
	Если Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ИндивидуальныйПредприниматель")
		И СтрДлина(ИНН) <> 12 Тогда
		Объект.ИНН = "";
		ВызватьИсключение "Длина ИНН должна быть равна 12 цифрам!";
	ИначеЕсли Объект.ТипОрганизации = ПредопределенноеЗначение("Перечисление.ТипыОрганизаций.ЮридическоеЛицо") 
		И СтрДлина(ИНН) <> 10 Тогда
		Объект.ИНН = "";
		ВызватьИсключение "Длина ИНН должна быть равна 10 цифрам!";
	КонецЕсли;
	
КонецПроцедуры









