
Функция createOrderPOST(Запрос)

	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Запрос.ПолучитьТелоКакСтроку()); //1
	ДанныеЗапроса = ПрочитатьJSON(ЧтениеJSON, Ложь);
	ЧтениеJSON.Закрыть();

	НоваяЗапись = Документы.ПредварительнаяЗапись.СоздатьДокумент(); //2
	НоваяЗапись.Сотрудник = Справочники.Сотрудники.НайтиПоНаименованию(ДанныеЗапроса.Сотрудник);
	НоваяЗапись.Клиент = Справочники.Пользователи.НайтиПоКоду(ДанныеЗапроса.GUIDПользователя).Клиент;
	НоваяЗапись.Дата = ТекущаяДата();
	НоваяЗапись.ДатаЗаписи = ПрочитатьДатуJSON(ДанныеЗапроса.ДатаЗаписи, ФорматДатыJSON.ISO);//3
	
	Для Каждого СтруктураУслуги Из ДанныеЗапроса.МассивУслуг Цикл //4
	    НоваяУслуга = НоваяЗапись.Услуги.Добавить();
	    НоваяУслуга.Услуга  = Справочники.Номенклатура.НайтиПоНаименованию(СтруктураУслуги.Услуга);
	    НоваяУслуга.Цена = Число(СтруктураУслуги.Цена);
	    НоваяУслуга.Количество = Число(СтруктураУслуги.Количество);
	    НоваяУслуга.Сумма = Число(СтруктураУслуги.Сумма);
	КонецЦикла;

	Попытка
	    НоваяЗапись.Записать(РежимЗаписиДокумента.Проведение); //5
	    ТекстОтвета = "Создан и проведен документ " + НоваяЗапись.Номер;
	    Ответ = Новый HTTPСервисОтвет(200);
	Исключение
	    Ответ = Новый HTTPСервисОтвет(500);
	    ТекстОтвета = "Произошла ошибка при проведении документа" + НоваяЗапись.Номер + "! " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;

	Ответ.УстановитьТелоИзСтроки(ТекстОтвета);

	Возврат Ответ;

КонецФункции
