Процедура ВыполнитьАутентификацию(Логин) Экспорт    
	
	Соединение    = Новый HTTPСоединение("192.168.0.184",,"MobileClient");//(1)
    Запрос        = Новый HTTPЗапрос("salon/hs/users/getUser?username="+Логин);//(2)
    Ответ        = Соединение.Получить(Запрос);//(3)    
    Если Ответ.КодСостояния = 200 Тогда
        МассивДанныхПользователя = ОбменСОсновнойБазой.JSONВОбъект(Ответ.ПолучитьТелоКакСтроку());
        Если МассивДанныхПользователя.Количество() = 0 Тогда //(4)
            Сообщить("По логину " + Логин +" пользователь не найден!");
        ИначеЕсли ПользователиИнформационнойБазы.ПолучитьПользователей().Количество() = 0 Тогда //(5)
            АвторизоватьПользователя(МассивданныхПользователя[0]);
        КонецЕсли;
    Иначе
        Сообщить("При попытке аутентификации произошла ошибка!");
	КонецЕсли;    
	
КонецПроцедуры

Процедура АвторизоватьПользователя(ДанныеПользователя) Экспорт
    
    НовыйПользовательИБ = ПользователиИнформационнойБазы.СоздатьПользователя();
    НовыйПользовательИБ.Имя = ДанныеПользователя.name;
    НовыйПользовательИБ.Роли.Добавить(Метаданные.Роли.АвторизованныйПользователь);
    НовыйПользовательИБ.Записать();
    
    ТекущийПользователь = Справочники.Пользователи.НайтиПоНаименованию(ДанныеПользователя.name);
    Если ТекущийПользователь.Пустая() Тогда
        НовыйПользователь = Справочники.Пользователи.СоздатьЭлемент();
        НовыйПользователь.Код = НовыйПользовательИБ.УникальныйИдентификатор;
        НовыйПользователь.ВнешнийGUID = ДанныеПользователя.code;  
        НовыйПользователь.Наименование = ДанныеПользователя.name;
        НовыйПользователь.Записать(); 
        ТекущийПользователь = НовыйПользователь.Ссылка;
	Иначе
		ПользовательОбъект = ТекущийПользователь.ПолучитьОбъект();
		ПользовательОбъект.Код = НовыйПользовательИБ.УникальныйИдентификатор;
		ПользовательОбъект.Записать();
    КонецЕсли;
    
    ПараметрыСеанса.ТекущийПользователь = ТекущийПользователь;
        
КонецПроцедуры

Процедура Разлогиниться() Экспорт
	
	Если ПользователиИнформационнойБазы.ПолучитьПользователей().Количество() > 0 Тогда
		ПользователиИнформационнойБазы.ТекущийПользователь().Удалить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ВыполнитьРегистрацию(Логин, Телефон) Экспорт
	
	Соединение 		= Новый HTTPСоединение("192.168.0.184",,"MobileClient");
	Запрос			= Новый HTTPЗапрос("salon/hs/users/createUser?username="+Логин +"&phone=" + Телефон);
	Ответ			= Соединение.Получить(Запрос);
	
	Если Ответ.КодСостояния = 200 Тогда
		МассивДанныхПользователя = ОбменСОсновнойБазой.JSONВОбъект(Ответ.ПолучитьТелоКакСтроку());
		АвторизоватьПользователя(МассивДанныхПользователя[0]);
	Иначе
		Сообщить(Ответ.ПолучитьТелоКакСтроку());
		Сообщить("Авторизация не удалась");
	КонецЕсли;
	
КонецПроцедуры
	
	